# 2.1[10]: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были 
# повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно 
# перевернуть. Количество монет и их положение (0 или 1) пользователь вводит с клавиатуры.
# Примеры/Тесты:
# Введите кол-во монет>? 5
# Положение монеты 0: 0 или 1>? 1
# ...
# 1 0 1 1 0
# Кол-во монет, чтобы перевернуть: 2

count_coins = 0 
obverse = 0
reverse = 0
coin_position = 0
count_coins = int(input('Введите количество монет: '))
for i in range(count_coins):
    coin_position = int(input('Введите положение монеты: '))
    if coin_position == 0:
        obverse += 1
    else:
      reverse += 1  
if obverse > reverse:
   print(reverse)
if reverse > obverse:
   print(obverse)
